Repository: AdryanneKelly/ackalantys_port_flutter
Catalog: lib/l10n/app_*.arb
Languages: pt

# hello
source: Hi, I'm Adryanne Kelly
pt: Oi, eu sou Adryanne Kelly

# occupation
source: Software Developer
pt: Desenvolvedora de Software

# introduction
source: Hey, guys! This is Adryanne Kelly, a software engineer passionate about challenges and discovering new solutions
pt: Oi, pessoal! Aqui é Adryanne Kelly, uma engenheira de software apaixonada em desafios e no descobrimento de novas soluções

# menuHome
source: Home
pt: Início

# menuAbout
source: About
pt: Sobre

# menuProject
source: Projects
pt: Projetos

# menuArticle
source: Articles
pt: Artigos

# menuContact
source: Contact
pt: Contato

source: My resume
pt: Meu CV

source: Get in touch
pt: Entre em contato

source: About me
pt: Sobre mim

# aboutMeTitle
source: A bit of me...
pt: Um pouco de mim...

# aboutMeDescription
source: Hey, everyone! I'm Adryanne, a software engineer with expertise in mobile development using Flutter and web applications with PHP and Laravel. I recently completed a postgraduate program in Software Engineering and actively participate in communities like Flutterando, where I’m also a moderator, and He4rt Devs, where people know me as Ackalantys. Beyond coding, I enjoy sharing knowledge through articles and videos to support the developer ecosystem. In my downtime, I love a good book and playing games!
pt: Oi, pessoal! Sou Adryanne, engenheira de software com foco em desenvolvimento mobile com Flutter e aplicações web usando PHP e Laravel. Concluí recentemente uma pós-graduação em Engenharia de Software e sou ativa nas comunidades Flutterando, onde atuo como moderadora, e He4rt Devs, onde sou conhecida como Ackalantys. Além de codar, gosto de compartilhar conhecimento através de artigos e vídeos para fortalecer o ecossistema de desenvolvimento. Nos momentos de lazer, um bom livro e jogos são minhas companhias!

source: Projects
pt: Projetos

# projectsTitle
source: Take a look at some of my projects
pt: Veja alguns de meus projetos

# projectTitle1
source: Dev Links - Project
pt: Dev Links - Projeto

# projectTitle2
source: Institutional website - Orbe Telecom
pt: Site institucional - Orbe Telecom

# projectTitle3
source: Orbe Cliente
pt: Orbe Cliente - App

# descriptionProject1
source: Personal project to create a personalised links page
pt: Projeto pessoal de criação personalizada de página de links

# descriptionProject2
source: Orbe Telecom's corporate website
pt: Site institucional da empresa Orbe Telecom

# descriptionProject3
source: Application for customers with many integrated facilities
pt: Aplicativo destinado a clientes com várias facilidades integradas

source: See all
pt: Ver tudo

source: Articles
pt: Artigos

# articlesTitle
source: Take a look at some of my articles!
pt: Dê uma olhada em alguns de meus artigos!

# articleTitle1
source: How to make a multi-language application with Flutter - PT-BR
pt: Como fazer aplicação multi-idioma com Flutter

# articleTitle2
source: Understanding State Pattern — Flutter PT-BR
pt: Entendendo State Pattern — Flutter

# articleTitle3
source: Autofilling fields in FilamentPHP using API - PT-BR
pt: Autopreenchimento de campos no FilamentPHP usando API

source: Contact
pt: Contato

# contactTitle
source: Enjoyed my work? Send me a message
pt: Gostou do meu trabalho? Mande-me uma mensagem

# contactDescription
source: Contact me by sending me a message or via my social networks
pt: Entre em contato comigo enviando uma mensagem ou pelas minhas redes sociais

# contactHintName
source: Name
pt: Seu nome

# contactNameValidation
source: Please enter a name
pt: Por favor, escreva seu nome

# contactHintEmail
source: Email
pt: Seu email

# contactEmailValidation
source: Please enter an email
pt: Por favor, escreva seu email

# contactHintMessage
source: Your message
pt: Mensagem

# contactMessageValidation
source: Please enter a message
pt: Por favor, escreva uma mensagem

# contactSendMessage
source: Send message
pt: Enviar mensagem

# contactSentMessage
source: Message sent!
pt: Mensagem enviada!
